//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                                                                     //
//                                                             ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                                               //
//                                                                                                                                                     //
//                                                                    Ｖ：１．０．１                                                                     //
//                                                                                                                                                     //
//                                     ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗  ░█████╗░██╗░░░░░███████╗░█████╗░                                          //
//                                     ██╔══██╗██║░░░░░██║██╔════╝████╗░██║  ██╔══██╗██║░░░░░██╔════╝██╔══██╗                                          //
//                                     ███████║██║░░░░░██║█████╗░░██╔██╗██║  ███████║██║░░░░░█████╗░░███████║                                          //
//                                     ██╔══██║██║░░░░░██║██╔══╝░░██║╚████║  ██╔══██║██║░░░░░██╔══╝░░██╔══██║                                          //
//                                     ██║░░██║███████╗██║███████╗██║░╚███║  ██║░░██║███████╗██║░░░░░██║░░██║                                          //
//                                     ╚═╝░░╚═╝╚══════╝╚═╝╚══════╝╚═╝░░╚══╝  ╚═╝░░╚═╝╚══════╝╚═╝░░░░░╚═╝░░╚═╝                                          //
//                                                                                                                                                     //
//                                                                                                                                                     //
//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//

// Obfuscated By AlienAlfa
// Unecrypted file Willbe relesed Soon
// Full file will be relised After all BUGS Has been Fixed

// CURRENTLY RUNNING ON BETA VERSION!!
/**
   * MIT License
* 
   * Copyright (c) 2021 Alien-Alfa.
* 
   * Permission is hereby granted, free of charge, to any person obtaining a copy
   * of this software and associated documentation files (the "Software"), to deal
   * in the Software without restriction, including without limitation the rights
   * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   * copies of the Software, and to permit persons to whom the Software is
   * furnished to do so, subject to the following conditions:
* 
   * The above copyright notice and this permission notice shall be included in all
   * copies or substantial portions of the Software.
* 
   * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
   * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
   * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
   * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
   * SOFTWARE.
*/




const fs = require('fs')
const chalk = require('chalk')


var ownernum = ['0','21230215371']
//-------------


// Website Api
global.APIs = {
	zenz: 'https://zenzapis.xyz',
	devil: 'https://api-toxic-devil.herokuapp.com/api',
} 
 
global.APIKeys = {
	'https://zenzapis.xyz': '' }
    


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //---------------------------------------------------------------------

   global.worktype = 'private'

   //---------------------------------------------------------------------
   
   
   //---------------------------------------------------------------------

   global.sudo = ['21230215371']
   //-------------
   global.owner = ['21230215371']

   //---------------------------------------------------------------------
   
   global.packname = 'V A N I T A S' 
   //-------------
   global.author = 'B O T'

   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MENU URL BUTTON 1 ------------------------

   global.linkbuttid1 = 'ɪɴꜱᴛᴀɢʀᴀᴍ' 
   //-------------
   global.butturl1 = 'https://www.instagram.com/VANITASX_D/'
   
   //---------------------------------------------------------------------



   //--------------------- MENU URL BUTTON 2 ------------------------

   global.linkbuttid2 = null
   //-------------
   global.butturl2 = null
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- ADPLAY OPTIONS ------------------------

   global.linktext = 'FOLLOW ME IN INSTAGRAM'
   //-------------
   global.linkurl = 'https://www.instagram.com/VANITASX_D/'
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN IMAGE  ------------------------

   global.profileimage = 'https://github.com/Alien-alfa/Alien-alfa/blob/beta/Alfa.jpg?raw=true'
      
   //---------------------------------------------------------------------

//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	

   //--------------------- URL IMAGE  ------------------------

   global.mainimgurl = 'https://github.com/Alien-alfa/Alien-alfa/blob/beta/Alfa.jpg?raw=true'
      
   //---------------------------------------------------------------------



//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN MENU BUTTON ------------------------
   
   global.mlinktxt1 = 'MY INSTAGRAM'
   //-------------
   global.mlinkurl1 = 'https://www.instagram.com/VANITASX_D/'
   //------------- 
   
 //------ URL BUTTON 2 -----
   global.mlinktxt2 = null
   //-------------
   global.mlinkurl2 = null
   //-------------
 
 //------ REP BUTTON 1 -----
   global.mbuttxt1 = 'ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅꜱ'
   //-------------
   global.mbutid1 = 'command'
   //-------------
   
 //------ REP BUTTON 2 -----
   global.mbuttxt2 = null 
   //-------------
   global.mbutid2 = null
   //-------------
   
 //------ REP BUTTON 3 -----
   global.mbuttxt3 = null
   //-------------
   global.mbutid3 = null
   //-------------
   
   //---------------------------------------------------------
   
//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ MAIN ============//

//-------------
global.premium = [`${ownernum}`]
//-------------
global.sessionName = 'session.alfa'
//-------------
global.prefa = ['','!','.','🐦','🐤','🗿']
//-------------
global.sp = '𒆜'
//-------------
global.devname = 'V A N I T A S'
//-------------
global.devNum = ['21230215371']
//-------------
global.greetings = 'Hey  👋🏻'
//-------------
global.listicon = '✩' 
//-------------
global.wm = 'B Y  V A N I T A S X D' 
//-------------
global.botname = 'V A N I T A S'
//-------------
global.icon = '✩' 
//-------------
global.mail = 'vanitasxdd@gmail.com'
//-------------
global.youtube = null
//-------------
global.github = null
//-------------
global.insta = 'https://www.instagram.com/vanitasx_d/' 
//-------------
global.linkname = 'V A N I T A S'
//-------------
global.mainfooter = 'VANITAS XD BOT' 
//-------------
global.herokuapi = '' 
//-------------
global.herokuapp = '' 


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ Modz ============//

//-------------
global.welcomeactive =  true
//-------------
global.alivemess = false
//-------------
global.aliveimage = false
//-------------
global.speedmode =  'active'
//-------------
global.ownermess = 'ʜᴇʏ ᴛʜɪꜱ ɪꜱ ᴍʏ ᴏᴡɴᴇʀ, ᴘʟᴇᴀꜱᴇ ᴛᴀʟᴋ ɪɴ ᴇɴɢʟɪꜱʜ'
//-------------
global.autoread = true
//-------------
global.anticall = true
//-------------





global.thumb = fs.readFileSync('./lib/lowdb/adapters/alfa.jpg')

global.mess = {
    success: 'تم',
    errr: 'خطأ',
    admin: 'للأدمن فقط',
    botAdmin: 'للأدمن فقط!',
    owner: 'للمطور!',
    group: 'للمجموعات',
    private: 'فالخاص!',
    bot: '',
    wait: 'إنتضر...',
    endLimit: 'ʏᴏᴜʀ ᴅᴀɪʟʏ ʟɪᴍɪᴛ ʜᴀꜱ ᴇxᴘɪʀᴇᴅ, ᴛʜᴇ ʟɪᴍɪᴛ ᴡɪʟʟ ʙᴇ ʀᴇꜱᴇᴛ ᴇᴠᴇʀʏ 12 ʜᴏᴜʀꜱ',
    notext: 'الرابط!',
}
global.limitawal = {
    premium: "Infinity",
    free: "Infinity"
}


let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update'${__filename}'`))
	delete require.cache[file]
	require(file)
})
